tutorials/RCE/0/Fr1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Fr1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    lower
    {
        type            zeroGradient;
    }
    upper
    {
        type            zeroGradient;
    }
    wall_cathode
    {
        type            zeroGradient;
    }
    wall_anode
    {
        type            zeroGradient;
    }
    cyclic_front
    {
        type            cyclic;
    }
    cyclic_back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
