tutorials/RCE/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    ".*er"
    {
	type            omegaWallFunction;
	value		$internalField;
       
    }
    "wall.*"
    {
        type            omegaWallFunction;
	value		$internalField;
    }
    "cyclic.*"
    {
        type            cyclic;
    }

}


// ************************************************************************* //
