tutorials/RCE/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

e1
            ( 
	      (0.005 0.15 10)    // % y-dir, % cells, expansion 
              (0.495 0.35 50)                                          
	      (0.495 0.35 0.02)
              (0.005 0.15 0.1)  
            ) ;

e2

            ( 
	      (0.1 0.2 5)    // % y-dir, % cells, expansion
              (0.8 0.6 1)
              (0.1 0.2 0.2) 
            ) ;


vertices
(

(	25.096091326	-1.095719011	0	)
(	49.303029735	-2.152616766	0	)
(	49.303029735	2.152616766	0	)
(	25.096091326	1.095719011	0	)
				
(	25.096091326	-1.095719011	151	)
(	49.303029735	-2.152616766	151	)
(	49.303029735	2.152616766	151	)
(	25.096091326	1.095719011	151	)


);

blocks
(
	hex (0 1 2 3 4 5 6 7) (150 1 500) simpleGrading ($e1 1 $e2) 
);
edges
(
	arc 1 2 (49.35 0 0)
	arc 5 6 (49.35 0 151)
	arc 0 3 (25.12 0 0)
	arc 4 7 (25.12 0 151)
);

boundary
(

lower
{
type wall;
	faces
	(
		(0 3 2 1)
	);
}

upper
{
type wall;
	faces
	(
		(7 4 5 6)
	);
}

wall_cathode
{
type wall;
	faces
	(
		(0 4 7 3)
	);
}

wall_anode
{
type wall;
	faces
	(
		(1 2 6 5)
	);
}

cyclic_front
{
	type cyclic;
	neighbourPatch wedge_back;
	faces
	(
		(1 5 4 0)
	);
}

cyclic_back
{
	type cyclic;
	neighbourPatch wedge_front;
	faces
	(
		(2 3 7 6)
	);
}

);

mergePatchPairs
(
);

// ************************************************************************* //
