tutorials/RCE/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     concentrationPimpleFoam;

startFrom       latestTime;// startTime;//

startTime       0;

stopAt          endTime;

endTime         25;

deltaT          1e-4;

writeControl    timeStep;

writeInterval   1;

purgeWrite      20;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo 200;

maxDeltaT 0.5;

libs (
	"libkOmegaSSTCC.so"
     );

// ************************************************************************* //
