tutorials/RCE/system/flux
//*--------------------------------*- C++ -*----------------------------------*\
//| =========                 |                                                 |
//| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
//|  \\    /   O peration     | Version:  dev                                     |
//|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
//|    \\/     M anipulation  |                                                 |
//\*---------------------------------------------------------------------------*/
 
flux
{
        type        wallFlux;//
        libs        ("libwallFluxFunctionObject.so");//
	patches     ("wall*.");

}


