tutorials/RCE/system/shearStress
//*--------------------------------*- C++ -*----------------------------------*\
//| =========                 |                                                 |
//| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
//|  \\    /   O peration     | Version:  dev                                     |
//|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
//|    \\/     M anipulation  |                                                 |
//\*---------------------------------------------------------------------------*/
 

shearStress
{
        type        wallSS;//
        libs        ("libwallSSFunctionObject.so");//
	patches     ("wall*.");

}



